//Отработка стандартных функций JavaScript
// В следующих задачах вы должны применить комбинацию стандартных функций JavaScript, чтобы решить задачу. Все методы вам известны, если вы делали задачи предыдущих уроков и проходили тесты.
//
//  Дана строка. Сделайте заглавным первый символ этой строки не используя цикл. Найдите два решения. Показать решение.
//
//  Дана строка, например, '123456'. Переверните эту строку (сделайте из нее '654321') не используя цикл. Показать решение.
//
//  Проверьте, что строка начинается на http://. Показать решение.
//
//  Проверьте, что строка заканчивается на .html. Показать решение.