//Отработка циклов
// В следующих задачах вы должны вспомнить работу с циклами JavaScript.
//
//  Выведите с помощью цикла столбец чисел от 1 до 100. Показать решение.
//
//  Выведите с помощью цикла столбец чисел от 100 до 1. Показать решение.
//
//  Выведите с помощью цикла столбец четных чисел от 1 до 100. Показать решение.
//
//  Заполните массив 10-ю иксами с помощью цикла. Показать решение.
//
//  Заполните массив числами от 1 до 10 с помощью цикла. Показать решение.
//
//  Заполните массив 10-ю случайными числами (дробями) от 0 до 1 с помощью цикла. Дроби округляйте до двух знаков в дробной части. Показать решение.
//
//  Заполните массив 10-ю случайными числами от 1 до 10 с помощью цикла. Показать решение.
//
//  Дан массив с числами. С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти. Показать решение.
//
//  Дан массив с числами. С помощью цикла проверьте, что в нем есть элемент со значением 5. Как только будет найден первый такой элемент - выведите 'Есть' и оборвите цикл. Если такого элемента нет - ничего не выводите. Показать решение.
//
//  Дан массив с числами. С помощью цикла найдите сумму элементов этого массива. Показать решение.
//
//  Дан массив с числами. С помощью цикла найдите сумму квадратов элементов этого массива. Показать решение.
//
//  Дан массив с числами. Найдите среднее арифметическое его элементов (сумма элементов, делить на количество). Показать решение.